zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SPC.h
#define SPC_VD_SYS_CFG_LVDIE_MASK                (0x2U)
#define SPC_VD_SYS_CFG_LVDIE_SHIFT               (1U)
/*! LVDIE - System LVD Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_VD_SYS_CFG_LVDIE(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_VD_SYS_CFG_LVDIE_SHIFT)) & SPC_VD_SYS_CFG_LVDIE_MASK)

#define SPC_VD_SYS_CFG_HVDRE_MASK                (0x4U)
#define SPC_VD_SYS_CFG_HVDRE_SHIFT               (2U)
/*! HVDRE - System HVD Reset Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_VD_SYS_CFG_HVDRE(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_VD_SYS_CFG_HVDRE_SHIFT)) & SPC_VD_SYS_CFG_HVDRE_MASK)

#define SPC_VD_SYS_CFG_HVDIE_MASK                (0x8U)
#define SPC_VD_SYS_CFG_HVDIE_SHIFT               (3U)
/*! HVDIE - System HVD Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SPC_VD_SYS_CFG_HVDIE(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_VD_SYS_CFG_HVDIE_SHIFT)) & SPC_VD_SYS_CFG_HVDIE_MASK)

#define SPC_VD_SYS_CFG_LVSEL_MASK                (0x100U)
#define SPC_VD_SYS_CFG_LVSEL_SHIFT               (8U)
/*! LVSEL - System Low-Voltage Level Select
 *  0b0..Normal
 *  0b1..Safe
 */
#define SPC_VD_SYS_CFG_LVSEL(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_VD_SYS_CFG_LVSEL_SHIFT)) & SPC_VD_SYS_CFG_LVSEL_MASK)

#define SPC_VD_SYS_CFG_LOCK_MASK                 (0x10000U)
#define SPC_VD_SYS_CFG_LOCK_SHIFT                (16U)
/*! LOCK - System Voltage Detect Reset Enable Lock
 *  0b0..Allow
 *  0b1..Deny
 */
#define SPC_VD_SYS_CFG_LOCK(x)                   (((uint32_t)(((uint32_t)(x)) << SPC_VD_SYS_CFG_LOCK_SHIFT)) & SPC_VD_SYS_CFG_LOCK_MASK)
/*! @} */

/*! @name EVD_CFG - External Voltage Domain Configuration */
/*! @{ */

#define SPC_EVD_CFG_EVDISO_MASK                  (0x3FU)
#define SPC_EVD_CFG_EVDISO_SHIFT                 (0U)
/*! EVDISO - External Voltage Domain Isolation */
#define SPC_EVD_CFG_EVDISO(x)                    (((uint32_t)(((uint32_t)(x)) << SPC_EVD_CFG_EVDISO_SHIFT)) & SPC_EVD_CFG_EVDISO_MASK)

#define SPC_EVD_CFG_EVDLPISO_MASK                (0x3F00U)
#define SPC_EVD_CFG_EVDLPISO_SHIFT               (8U)
/*! EVDLPISO - External Voltage Domain Low-Power Isolation */
#define SPC_EVD_CFG_EVDLPISO(x)                  (((uint32_t)(((uint32_t)(x)) << SPC_EVD_CFG_EVDLPISO_SHIFT)) & SPC_EVD_CFG_EVDLPISO_MASK)

#define SPC_EVD_CFG_EVDSTAT_MASK                 (0x3F0000U)
#define SPC_EVD_CFG_EVDSTAT_SHIFT                (16U)
/*! EVDSTAT - External Voltage Domain Status */
#define SPC_EVD_CFG_EVDSTAT(x)                   (((uint32_t)(((uint32_t)(x)) << SPC_EVD_CFG_EVDSTAT_SHIFT)) & SPC_EVD_CFG_EVDSTAT_MASK)
/*! @} */

/*! @name GLITCH_DETECT_SC - Glitch Detect Status Control */
/*! @{ */

#define SPC_GLITCH_DETECT_SC_CNT_SELECT_MASK     (0x3U)
#define SPC_GLITCH_DETECT_SC_CNT_SELECT_SHIFT    (0U)
/*! CNT_SELECT - Counter Select
 *  0b00..0
 *  0b01..1
 *  0b10..2
 *  0b11..3
 */
#define SPC_GLITCH_DETECT_SC_CNT_SELECT(x)       (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_CNT_SELECT_SHIFT)) & SPC_GLITCH_DETECT_SC_CNT_SELECT_MASK)

#define SPC_GLITCH_DETECT_SC_TIMEOUT_MASK        (0x3CU)
#define SPC_GLITCH_DETECT_SC_TIMEOUT_SHIFT       (2U)
/*! TIMEOUT - Timeout */
#define SPC_GLITCH_DETECT_SC_TIMEOUT(x)          (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_TIMEOUT_SHIFT)) & SPC_GLITCH_DETECT_SC_TIMEOUT_MASK)

#define SPC_GLITCH_DETECT_SC_RE_MASK             (0x40U)
#define SPC_GLITCH_DETECT_SC_RE_SHIFT            (6U)
/*! RE - Glitch Detect Reset Enable
 *  0b0..Disables POR/LVD reset generation
 *  0b1..Enables POR/LVD reset generation
 */
#define SPC_GLITCH_DETECT_SC_RE(x)               (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_RE_SHIFT)) & SPC_GLITCH_DETECT_SC_RE_MASK)

#define SPC_GLITCH_DETECT_SC_IE_MASK             (0x80U)
#define SPC_GLITCH_DETECT_SC_IE_SHIFT            (7U)
/*! IE - Glitch Detect Interrupt Enable
 *  0b0..Disables automatic interrupt generation (user polling)
 *  0b1..Enables automatic interrupt generation
 */
#define SPC_GLITCH_DETECT_SC_IE(x)               (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_IE_SHIFT)) & SPC_GLITCH_DETECT_SC_IE_MASK)

#define SPC_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_MASK (0xF00U)
#define SPC_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_SHIFT (8U)
/*! GLITCH_DETECT_FLAG - GLITCH_DETECT_FLAG */
#define SPC_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG(x) (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_SHIFT)) & SPC_GLITCH_DETECT_SC_GLITCH_DETECT_FLAG_MASK)

#define SPC_GLITCH_DETECT_SC_LOCK_MASK           (0x10000U)
#define SPC_GLITCH_DETECT_SC_LOCK_SHIFT          (16U)
/*! LOCK - Glitch Detect Reset Enable Lock Bit
 *  0b0..Writes to RE are allowed.
 *  0b1..Writes to RE are ignored.
 */
#define SPC_GLITCH_DETECT_SC_LOCK(x)             (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_LOCK_SHIFT)) & SPC_GLITCH_DETECT_SC_LOCK_MASK)

#define SPC_GLITCH_DETECT_SC_HIGH_GAIN_MODE_MASK (0x20000U)
#define SPC_GLITCH_DETECT_SC_HIGH_GAIN_MODE_SHIFT (17U)
/*! HIGH_GAIN_MODE - High Gain Mode Enable
 *  0b0..High Gain Model disabled.
 *  0b1..High Gain Model enabled.
 */
#define SPC_GLITCH_DETECT_SC_HIGH_GAIN_MODE(x)   (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_HIGH_GAIN_MODE_SHIFT)) & SPC_GLITCH_DETECT_SC_HIGH_GAIN_MODE_MASK)

#define SPC_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_MASK (0x40000U)
#define SPC_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_SHIFT (18U)
/*! HVDD_AMP_DISABLE - HVDD AMP DISABLE
 *  0b0..HVDD Amplifier detection enabled.
 *  0b1..HVDD Amplifier detection disabled.
 */
#define SPC_GLITCH_DETECT_SC_HVDD_AMP_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_SHIFT)) & SPC_GLITCH_DETECT_SC_HVDD_AMP_DISABLE_MASK)
/*! @} */

/*! @name GLITCH_VDDA_DETECT_SC - VDDA Glitch Detect Status Control */
/*! @{ */

#define SPC_GLITCH_VDDA_DETECT_SC_CNT_SELECT_MASK (0x3U)
#define SPC_GLITCH_VDDA_DETECT_SC_CNT_SELECT_SHIFT (0U)
/*! CNT_SELECT - Counter Select
 *  0b00..0
 *  0b01..1
 *  0b10..2
 *  0b11..3
 */
#define SPC_GLITCH_VDDA_DETECT_SC_CNT_SELECT(x)  (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_VDDA_DETECT_SC_CNT_SELECT_SHIFT)) & SPC_GLITCH_VDDA_DETECT_SC_CNT_SELECT_MASK)

#define SPC_GLITCH_VDDA_DETECT_SC_TIMEOUT_MASK   (0x3CU)
#define SPC_GLITCH_VDDA_DETECT_SC_TIMEOUT_SHIFT  (2U)
/*! TIMEOUT - Timeout */
#define SPC_GLITCH_VDDA_DETECT_SC_TIMEOUT(x)     (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_VDDA_DETECT_SC_TIMEOUT_SHIFT)) & SPC_GLITCH_VDDA_DETECT_SC_TIMEOUT_MASK)

#define SPC_GLITCH_VDDA_DETECT_SC_RE_MASK        (0x40U)
#define SPC_GLITCH_VDDA_DETECT_SC_RE_SHIFT       (6U)
/*! RE - Glitch Detect Reset Enable
 *  0b0..Disables POR/LVD reset generation
 *  0b1..Enables POR/LVD reset generation
 */
#define SPC_GLITCH_VDDA_DETECT_SC_RE(x)          (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_VDDA_DETECT_SC_RE_SHIFT)) & SPC_GLITCH_VDDA_DETECT_SC_RE_MASK)

#define SPC_GLITCH_VDDA_DETECT_SC_IE_MASK        (0x80U)
#define SPC_GLITCH_VDDA_DETECT_SC_IE_SHIFT       (7U)
/*! IE - Glitch Detect Interrupt Enable
 *  0b0..Disables automatic interrupt generation (user polling)
 *  0b1..Enables automatic interrupt generation
 */
#define SPC_GLITCH_VDDA_DETECT_SC_IE(x)          (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_VDDA_DETECT_SC_IE_SHIFT)) & SPC_GLITCH_VDDA_DETECT_SC_IE_MASK)

#define SPC_GLITCH_VDDA_DETECT_SC_GLITCH_DETECT_FLAG_MASK (0xF00U)
#define SPC_GLITCH_VDDA_DETECT_SC_GLITCH_DETECT_FLAG_SHIFT (8U)
/*! GLITCH_DETECT_FLAG - GLITCH_DETECT_FLAG */
#define SPC_GLITCH_VDDA_DETECT_SC_GLITCH_DETECT_FLAG(x) (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_VDDA_DETECT_SC_GLITCH_DETECT_FLAG_SHIFT)) & SPC_GLITCH_VDDA_DETECT_SC_GLITCH_DETECT_FLAG_MASK)

#define SPC_GLITCH_VDDA_DETECT_SC_LOCK_MASK      (0x10000U)
#define SPC_GLITCH_VDDA_DETECT_SC_LOCK_SHIFT     (16U)
/*! LOCK - Glitch Detect Reset Enable Lock Bit
 *  0b0..Writes to RE are allowed.
 *  0b1..Writes to RE are ignored.
 */
#define SPC_GLITCH_VDDA_DETECT_SC_LOCK(x)        (((uint32_t)(((uint32_t)(x)) << SPC_GLITCH_VDDA_DETECT_SC_LOCK_SHIFT)) & SPC_GLITCH_VDDA_DETECT_SC_LOCK_MASK)
/*! @} */

/*! @name CORELDO_CFG - LDO_CORE Configuration */
/*! @{ */

#define SPC_CORELDO_CFG_CORELDO_SPARE_MASK       (0x1F0000U)
#define SPC_CORELDO_CFG_CORELDO_SPARE_SHIFT      (16U)
/*! CORELDO_SPARE - CORELDO_SPARE
 *  0b00000..TBD.
 *  0b00001..TBD.
 */
#define SPC_CORELDO_CFG_CORELDO_SPARE(x)         (((uint32_t)(((uint32_t)(x)) << SPC_CORELDO_CFG_CORELDO_SPARE_SHIFT)) & SPC_CORELDO_CFG_CORELDO_SPARE_MASK)

#define SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_MASK (0x800000U)
#define SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_SHIFT (23U)
/*! DPDOWN_PULLDOWN_DISABLE - LDO_CORE Deep Power Down Pulldown Disable
 *  0b0..LDO_CORE pulldown in Deep Power Down not disabled
 *  0b1..LDO_CORE pulldown in Deep Power Down disabled
 */
#define SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_SHIFT)) & SPC_CORELDO_CFG_DPDOWN_PULLDOWN_DISABLE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPC_Register_Masks */


/*!
 * @}
 */ /* end of group SPC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SPC_H_ */

